weifengdq/embedded/tc397/tc397_adc/Libraries/iLLD/TC3xx/Tricore/_PinMap/TC39xB/IfxGtm_PinMap_TC39xB_LFBGA516.c
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P32_5_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P32, 5}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM3_5_P34_2_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_5, {&MODULE_P34, 2}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P00_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P00, 7}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P02_12_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P02,12}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P11_11_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P11,11}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P13_1_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P13, 1}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P13_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P13, 7}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P14_15_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P14,15}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P15_3_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P15, 3}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P20_10_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P20,10}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P20_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P20, 6}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P22_10_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P22,10}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P25_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P25, 6}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P26_0_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P26, 0}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P32_6_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P32, 6}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM3_6_P34_3_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_6, {&MODULE_P34, 3}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P00_8_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P00, 8}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P02_13_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P02,13}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P11_12_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P11,12}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P13_15_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P13,15}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P13_2_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P13, 2}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P15_4_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P15, 4}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P20_11_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P20,11}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P20_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P20, 7}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P22_11_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P22,11}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P25_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P25, 7}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P32_7_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P32, 7}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM3_7_P34_4_IN = {IfxGtm_Tim_3, IfxGtm_Tim_Ch_7, {&MODULE_P34, 4}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P00_13_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P00,13}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P00_9_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P00, 9}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P01_12_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P01,12}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P02_12_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P02,12}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P10_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P10, 0}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P10_8_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P10, 8}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P11_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P11, 0}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P12_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P12, 0}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P13_12_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P13,12}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P21_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P21, 0}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P24_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P24, 0}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P25_8_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P25, 8}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P30_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P30, 0}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_0_P32_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_0, {&MODULE_P32, 7}, (IfxGtm_ChXSel)15};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P00_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P00,10}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P00_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P00,15}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P01_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P01, 1}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P02_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P02,15}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P10_9_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P10, 9}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P11_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P11, 1}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P12_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P12, 1}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P15_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P15,10}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P21_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P21, 1}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P24_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P24, 1}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P25_9_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P25, 9}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P30_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P30, 1}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_1_P32_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_1, {&MODULE_P32, 5}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P00_11_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P00,11}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P01_9_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P01, 9}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P02_13_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P02,13}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P02_9_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P02, 9}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P10_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P10,10}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P10_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P10, 6}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P11_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P11, 4}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P15_11_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P15,11}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P21_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P21, 6}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P23_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P23, 6}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P24_2_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P24, 2}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P25_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P25,10}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM4_2_P30_2_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_2, {&MODULE_P30, 2}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P00_12_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P00,12}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P01_13_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P01,13}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P02_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P02,10}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P02_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P02,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P10_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P10,14}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P10_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P10, 5}, (IfxGtm_ChXSel)13};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P11_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P11, 5}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P15_12_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P15,12}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P21_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P21, 7}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P23_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P23, 7}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P24_3_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P24, 3}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P25_11_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P25,11}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM4_3_P30_3_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_3, {&MODULE_P30, 3}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P01_0_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P01, 0}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P01_8_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P01, 8}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P02_11_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P02,11}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P10_13_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P10,13}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P10_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P10, 1}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P11_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P11, 7}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P15_13_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P15,13}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P20_1_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P20, 1}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P24_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P24, 4}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P25_12_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P25,12}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P30_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P30, 4}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P32_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P32, 6}, (IfxGtm_ChXSel)15};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P33_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P33,10}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM4_4_P33_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_4, {&MODULE_P33, 4}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P01_10_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P01,10}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P01_2_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P01, 2}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P01_3_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P01, 3}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P10_11_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P10,11}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P10_2_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P10, 2}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P11_8_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P11, 8}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P15_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P15,14}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P20_3_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P20, 3}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P24_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P24, 5}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P25_13_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P25,13}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P30_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P30, 5}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P33_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P33,14}, (IfxGtm_ChXSel)14};
IfxGtm_Tim_TinMap IfxGtm_TIM4_5_P33_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_5, {&MODULE_P33, 5}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P01,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P01,15}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P01_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P01, 4}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P10_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P10,15}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P10_3_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P10, 3}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P11_13_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P11,13}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P15_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P15,15}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P24_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P24, 6}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P25_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P25,14}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P30_6_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P30, 6}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM4_6_P33_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_6, {&MODULE_P33,15}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P00_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P00,14}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P01_11_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P01,11}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P10_4_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P10, 4}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P11_14_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P11,14}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P11_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P11,15}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P13_9_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P13, 9}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P14_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P14, 7}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P24_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P24, 7}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P25_15_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P25,15}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P30_7_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P30, 7}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM4_7_P34_5_IN = {IfxGtm_Tim_4, IfxGtm_Tim_Ch_7, {&MODULE_P34, 5}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P00_13_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P00,13}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P01_12_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P01,12}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P01_8_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P01, 8}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P02_12_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P02,12}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P13_11_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P13,11}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P22_8_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P22, 8}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P24_8_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P24, 8}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P30_8_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P30, 8}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P31_8_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P31, 8}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM5_0_P33_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_0, {&MODULE_P33,14}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P00_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P00,15}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P01_1_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P01, 1}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P01_9_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P01, 9}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P02_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P02,15}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P13_10_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P13,10}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P14_11_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P14,11}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P22_9_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P22, 9}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P24_9_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P24, 9}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P30_9_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P30, 9}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P31_9_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P31, 9}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_1_P33_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_1, {&MODULE_P33,15}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P01_10_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P01,10}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P01_9_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P01, 9}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P02_13_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P02,13}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P13_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P13,14}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P14_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P14,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P22_10_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P22,10}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P24_10_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P24,10}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P30_10_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P30,10}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM5_2_P31_10_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_2, {&MODULE_P31,10}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_11_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P01,11}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_13_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P01,13}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P01_5_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P01, 5}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P02_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P02,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P13_4_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P13, 4}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P14_13_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P14,13}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P22_11_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P22,11}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P24_11_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P24,11}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P30_11_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P30,11}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P31_11_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P31,11}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_3_P34_1_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_3, {&MODULE_P34, 1}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P00_0_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P00, 0}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P01_0_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P01, 0}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P01_8_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P01, 8}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P13_5_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P13, 5}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P14_12_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P14,12}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P21_2_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P21, 2}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P24_12_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P24,12}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P30_12_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P30,12}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P31_12_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P31,12}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_4_P34_2_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_4, {&MODULE_P34, 2}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P00_1_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P00, 1}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_10_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P01,10}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_2_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P01, 2}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P01_6_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P01, 6}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P13_13_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P13,13}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P13_6_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P13, 6}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P21_3_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P21, 3}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P24_13_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P24,13}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P30_13_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P30,13}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P31_13_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P31,13}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P32_5_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P32, 5}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_5_P34_3_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_5, {&MODULE_P34, 3}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P00_2_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P00, 2}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P01,14}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P01,15}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P01_6_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P01, 6}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P13_7_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P13, 7}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P14_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P14,15}, (IfxGtm_ChXSel)5};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P21_4_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P21, 4}, (IfxGtm_ChXSel)12};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P24_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P24,14}, (IfxGtm_ChXSel)6};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P30_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P30,14}, (IfxGtm_ChXSel)7};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P31_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P31,14}, (IfxGtm_ChXSel)8};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P32_6_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P32, 6}, (IfxGtm_ChXSel)9};
IfxGtm_Tim_TinMap IfxGtm_TIM5_6_P34_4_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_6, {&MODULE_P34, 4}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P00_14_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P00,14}, (IfxGtm_ChXSel)1};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P00_3_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P00, 3}, (IfxGtm_ChXSel)10};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P01_11_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P01,11}, (IfxGtm_ChXSel)3};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P01_7_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P01, 7}, (IfxGtm_ChXSel)2};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P13_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P13,15}, (IfxGtm_ChXSel)4};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P21_5_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P21, 5}, (IfxGtm_ChXSel)11};
IfxGtm_Tim_TinMap IfxGtm_TIM5_7_P24_15_IN = {IfxGtm_Tim_5, IfxGtm_Tim_Ch_7, {&MODULE_P24,15}, (IfxGtm_ChXSel)5};
